In [1]:
!pip install mysql-connector

Collecting mysql-connector
  Downloading mysql-connector-2.2.9.tar.gz (11.9 MB)
Building wheels for collected packages: mysql-connector
  Building wheel for mysql-connector (setup.py): started
  Building wheel for mysql-connector (setup.py): finished with status 'done'
  Created wheel for mysql-connector: filename=mysql_connector-2.2.9-cp39-cp39-win_amd64.whl size=247961 sha256=aaa8c37d6be23c8180a2e48d80c74f32e2c9049eaeac6f6ea57c373f1043b910
  Stored in directory: c:\users\aayush\appdata\local\pip\cache\wheels\7b\14\39\5aad423666e827dfe9a1fbcd111ac17171e7c9865d570780ce
Successfully built mysql-connector
Installing collected packages: mysql-connector
Successfully installed mysql-connector-2.2.9

In [2]:
import mysql.connector
#importing database
database = mysql.connector.connect(
host="localhost",
user="root",
password=""
)
db = database.cursor()

db.execute("CREATE DATABASE pythons")

In [10]:
import mysql.connector
#importing database
database = mysql.connector.connect(
host="localhost",
user="root",
password="",
database = "class4pm"
)
db = database.cursor()

In [2]:
db.execute("SELECT * FROM student")
result =db.fetchall()
for data in result:
    print(data)

(1, 'Ram', 89.0, 87.0, 67.0, 87.0, 67.0, 412.0, 82.5, 'A')
(2, 'Shyam', 98.0, 67.0, 67.0, 98.0, 94.0, 450.0, 88.5, 'A')
(3, 'Hari', 89.0, 67.0, 80.0, 81.0, 67.0, 410.0, 85.5, 'A')
(4, 'Nabin', 89.0, 87.0, 67.0, 81.0, 67.0, 421.0, 85.6, 'A')

In [3]:
db.execute("SELECT * FROM student WHERE name = 'Hari'")
result =db.fetchall()
for data in result:
    print(data)

(3, 'Hari', 89.0, 67.0, 80.0, 81.0, 67.0, 410.0, 85.5, 'A')

In [4]:
db.execute("SELECT * FROM student WHERE total > 410")
result =db.fetchall()
for data in result:
    print(data)

(1, 'Ram', 89.0, 87.0, 67.0, 87.0, 67.0, 412.0, 82.5, 'A')
(2, 'Shyam', 98.0, 67.0, 67.0, 98.0, 94.0, 450.0, 88.5, 'A')
(4, 'Nabin', 89.0, 87.0, 67.0, 81.0, 67.0, 421.0, 85.6, 'A')

In [5]:
db.execute("SELECT sn, name, total, per, grade FROM student")
result =db.fetchall()
for data in result:
    print(data)

(1, 'Ram', 412.0, 82.5, 'A')
(2, 'Shyam', 450.0, 88.5, 'A')
(3, 'Hari', 410.0, 85.5, 'A')
(4, 'Nabin', 421.0, 85.6, 'A')

In [6]:
sql = '''INSERT INTO `student` ( `name`, `physics`, `chemistry`, `math`, `english`, `nepali`, `total`, `per`, `grade`) 
VALUES ( 'ram Prasad', '56', '67', '67', '91', '67', '378', '72.5', 'B')'''
db.execute(sql)
database.commit()

In [8]:
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    physics = int(input("Enter physics marks = "))
    chemistry = int(input("Enter chemistry marks = "))
    math = int(input("Enter math marks = "))
    english = int(input("Enter english marks = "))
    nepali = int(input("Enter nepali marks = "))
    total = sum([physics,chemistry,math,english,nepali])
    per = total/5
    if per>=80:
        grade = 'A'
    elif per>=60:
        grade = 'B'
    elif per>=45:
        grade = 'C'
    else:
        grade = 'F'
        
    sql = f'''INSERT INTO student ( name, physics, chemistry, math, english, nepali, total, per, grade) 
    VALUES ( '{name}',{physics} , {chemistry}, {math}, {english}, {nepali}, {total}, {per}, '{grade}')'''
    print(sql)
    db.execute(sql)
    
database.commit()

Enter n = 1
Enter name = Nabin
Enter physics marks = 89
Enter chemistry marks = 87
Enter math marks = 67
Enter english marks = 98
Enter nepali marks = 78
INSERT INTO student ( name, physics, chemistry, math, english, nepali, total, per, grade)
    VALUES ( 'Nabin',89 , 87, 67, 98, 78, 419, 83.8, 'A')

In [ ]:
# Delete
sql = "DELETE FROM student WHERE sn = 5"
db.execute(sql)
databse.commit()

In [12]:
ids = int(input("Enter id = "))
sql = f"DELETE FROM student WHERE sn = {ids}"
db.execute(sql)
database.commit()

Enter id = 5

In [13]:
# Update
sql = "UPDATE student SET name = 'Nabina' WHERE name = 'Nabin'"
db.execute(sql)
database.commit()

In [14]:
# Update
sql = "UPDATE student SET name = 'Nabina' WHERE name = 'Nabin' and grade = 'A'"
db.execute(sql)
database.commit()